content/euler/13.md
+++
title = "Project Euler 13: Large Sum"
author = ["Gautam Manohar"]
description = "My solution to problem 13 of Project Euler."
date = 2018-06-10
tags = ["brute-force", "string"]
categories = ["euler"]
draft = false
+++

## Problem Statement {#problem-statement}

Find the first ten digits of the sum of \\(N\\) 50-digit numbers.


## My Algorithm {#my-algorithm}

Thanks to Python's built-in ability to handle infinitely large integers, this
problem is a piece of cake. We read in the numbers, add them, convert the result
to a string, and output the first ten characters.


### Other Solutions {#other-solutions}

In languages without big integer support, we would need an algorithm to add big
integers, using string arrays and the carrying method often taught in elementary
schools.